03-airFoil2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//Added for force output.
libs
(
    "libforces.so"
);

functions
{
    airfoil
    {
        patches             (walls);
        CofR                (0 0 0);
        outputControl 	    timeStep;
        outputInterval 	    5;
        type 		    forces;
        p 		    p;
        U 		    U;
        rho 		    rhoInf;
        rhoInf 		    1;
        log 		    true;
    }
}
// ************************************************************************* //
